HungChienSix/Renesas_SourceCode/Renesas.RA_DFP.6.4.0/SVD/R7FA2L209.svd
                <register>
                    <name>LVDLVLR</name>
                    <description>Voltage Detection Level Select Register</description>
                    <addressOffset>0x418</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x07</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LVD1LVL</name>
                            <description>Voltage Detection 1 Level Select (Standard voltage during fall in voltage)</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>Vdet1_0</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x01</name>
                                    <description>Vdet1_1</description>
                                    <value>0x01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x02</name>
                                    <description>Vdet1_2</description>
                                    <value>0x02</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x03</name>
                                    <description>Vdet1_3</description>
                                    <value>0x03</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x04</name>
                                    <description>Vdet1_4</description>
                                    <value>0x04</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x05</name>
                                    <description>Vdet1_5</description>
                                    <value>0x05</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x06</name>
                                    <description>Vdet1_6</description>
                                    <value>0x06</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x07</name>
                                    <description>Vdet1_7</description>
                                    <value>0x07</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x08</name>
                                    <description>Vdet1_8</description>
                                    <value>0x08</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x09</name>
                                    <description>Vdet1_9</description>
                                    <value>0x09</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0A</name>
                                    <description>Vdet1_A</description>
                                    <value>0x0a</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0B</name>
                                    <description>Vdet1_B</description>
                                    <value>0x0b</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0C</name>
                                    <description>Vdet1_C</description>
                                    <value>0x0c</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0D</name>
                                    <description>Vdet1_D</description>
                                    <value>0x0d</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0E</name>
                                    <description>Vdet1_E</description>
                                    <value>0x0e</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>Vdet1_F</description>
                                    <value>0x0f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD2LVL</name>
                            <description>Voltage Detection 2 Level Select (Standard voltage during fall in voltage)</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>Vdet2_0</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>Vdet2_1</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>Vdet2_2</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>Vdet2_3</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVD1CR0</name>
                    <description>Voltage Monitor 1 Circuit Control Register 0</description>
                    <addressOffset>0x41A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>RIE</name>
                            <description>Voltage Monitor 1 Interrupt/Reset Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPE</name>
                            <description>Voltage Monitor 1 Circuit Comparison Result Output Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable voltage monitor 1 circuit comparison result output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable voltage monitor 1 circuit comparison result output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RI</name>
                            <description>Voltage Monitor 1 Circuit Mode Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generate voltage monitor 1 interrupt on Vdet1 crossing</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable voltage monitor 1 reset when the voltage falls to and below Vdet1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RN</name>
                            <description>Voltage Monitor 1 Reset Negate Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Negate after a stabilization time (tLVD1) when VCC &gt; Vdet1 is detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Negate after a stabilization time (tLVD1) on assertion of the LVD1 reset</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVD2CR0</name>
                    <description>Voltage Monitor 2 Circuit Control Register 0</description>
                    <addressOffset>0x41B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>RIE</name>
                            <description>Voltage Monitor 2 Interrupt/Reset Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPE</name>
                            <description>Voltage Monitor 2 Circuit Comparison Result Output Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable voltage monitor 2 circuit comparison result output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable voltage monitor 2 circuit comparison result output</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RI</name>
                            <description>Voltage Monitor 2 Circuit Mode Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generate voltage monitor 2 interrupt on Vdet2 crossing</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable voltage monitor 2 reset when the voltage falls to and below Vdet2</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RN</name>
                            <description>Voltage Monitor 2 Reset Negate Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Negate after a stabilization time (tLVD2) when VCC &gt; Vdet2 is detected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Negate after a stabilization time (tLVD2) on assertion of the LVD2 reset</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOSCCR</name>
                    <description>Sub-Clock Oscillator Control Register</description>
                    <addressOffset>0x480</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SOSTP</name>
                            <description>Sub Clock Oscillator Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Operate the sub-clock oscillator</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stop the sub-clock oscillator</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOMCR</name>
                    <description>Sub-Clock Oscillator Mode Control Register</description>
                    <addressOffset>0x481</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SODRV</name>
                            <description>Sub-Clock Oscillator Drive Capability Switching</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Normal Mode</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Low Power Mode 1</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Low Power Mode 2</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Low Power Mode 3</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOMRG</name>
                    <description>Sub-Clock Oscillator Margin Check Register</description>
                    <addressOffset>0x482</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SOSCMRG</name>
                            <description>Sub Clock Oscillator Margin check Switching</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Normal Current</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Lower Margin check</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Upper Margin check</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Setting prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
