HungChienSix/Renesas_SourceCode/Renesas.RA_DFP.6.4.0/SVD/R7FA2L209.svd
                <register>
                    <name>CETSM</name>
                    <description>CCC Exchange Timing Support Information M (Mode) Register</description>
                    <addressOffset>0x374</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FREQ</name>
                            <description>Frequency Byte</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>32.0 kHz</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>7.5 MHz</description>
                                    <value>0x0f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>15.5 MHz</description>
                                    <value>0x1f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2F</name>
                                    <description>23.5 MHz</description>
                                    <value>0x2f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3F</name>
                                    <description>31.5 MHz</description>
                                    <value>0x3f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4F</name>
                                    <description>39.5 MHz</description>
                                    <value>0x4f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5F</name>
                                    <description>47.5 MHz</description>
                                    <value>0x5f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6F</name>
                                    <description>55.5 MHz</description>
                                    <value>0x6f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7F</name>
                                    <description>63.5 MHz</description>
                                    <value>0x7f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INAC</name>
                            <description>Inaccuracy Byte</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x00</name>
                                    <description>0.0%</description>
                                    <value>0x00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0F</name>
                                    <description>1.5%</description>
                                    <value>0x0f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x1F</name>
                                    <description>3.1%</description>
                                    <value>0x1f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x2F</name>
                                    <description>4.7%</description>
                                    <value>0x2f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x3F</name>
                                    <description>6.3%</description>
                                    <value>0x3f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x4F</name>
                                    <description>7.9%</description>
                                    <value>0x4f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x5F</name>
                                    <description>9.5%</description>
                                    <value>0x5f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x6F</name>
                                    <description>11.1%</description>
                                    <value>0x6f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x7F</name>
                                    <description>12.7%</description>
                                    <value>0x7f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x8F</name>
                                    <description>14.3%</description>
                                    <value>0x8f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x9F</name>
                                    <description>15.9%</description>
                                    <value>0x9f</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xAF</name>
                                    <description>17.5%</description>
                                    <value>0xaf</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xBF</name>
                                    <description>19.1%</description>
                                    <value>0xbf</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xCF</name>
                                    <description>20.7%</description>
                                    <value>0xcf</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xDF</name>
                                    <description>22.3%</description>
                                    <value>0xdf</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xEF</name>
                                    <description>23.9%</description>
                                    <value>0xef</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0xFF</name>
                                    <description>25.5%</description>
                                    <value>0xff</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BITCNT</name>
                    <description>Bit Count Register</description>
                    <addressOffset>0x380</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>BCNT</name>
                            <description>Bit Counter</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NQSTLV</name>
                    <description>Normal Queue Status Level Register</description>
                    <addressOffset>0x394</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMDQFLV</name>
                            <description>Normal Command Queue Free Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSPQLV</name>
                            <description>Normal Response Queue Level</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IBIQLV</name>
                            <description>Normal IBI Queue Level</description>
                            <lsb>16</lsb>
                            <msb>23</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IBISCNT</name>
                            <description>Normal IBI Status Count</description>
                            <lsb>24</lsb>
                            <msb>28</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDBSTLV0</name>
                    <description>Normal Data Buffer Status Level Register 0</description>
                    <addressOffset>0x398</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000001</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>TDBFLV</name>
                            <description>Normal Transmit Data Buffer Free Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDBLV</name>
                            <description>Normal Receive Data Buffer Level</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NRSQSTLV</name>
                    <description>Normal Receive Status Queue Status Level Register</description>
                    <addressOffset>0x3C0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RSQLV</name>
                            <description>Normal Receive Status Queue Level</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PRSTDBG</name>
                    <description>Present State Debug Register</description>
                    <addressOffset>0x3CC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0000000F</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCILV</name>
                            <description>SCL Line Signal Level</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SDILV</name>
                            <description>SDA Line Signal Level</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCOLV</name>
                            <description>SCL Output Level</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>I3C has driven the SCL pin low.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>I3C has released the SCL pin.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SDOLV</name>
                            <description>SDA Output Level</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>I3C has driven the SDA pin low.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>I3C has released the SDA pin.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSERRCNT</name>
                    <description>Master Error Counters Register</description>
                    <addressOffset>0x3D0</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>M2ECNT</name>
                            <description>M2 Error Counter</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
